#### Terraform Format and Style 🖌``
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>GitHub Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vystmo-inc/gh-actions-demo/runs/run-oBhB3Bi4TcVTeNzT

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

azurerm_resource_group.rg-tcloud-azure: Refreshing state... [id=/subscriptions/8534e7bb-0c6b-4358-9861-7e972e81a5ea/resourceGroups/rg-tcloud-azure]
azurerm_virtual_network.tfcloud: Refreshing state... [id=/subscriptions/8534e7bb-0c6b-4358-9861-7e972e81a5ea/resourceGroups/rg-tcloud-azure/providers/Microsoft.Network/virtualNetworks/tf-network]
azurerm_subnet.internal: Refreshing state... [id=/subscriptions/8534e7bb-0c6b-4358-9861-7e972e81a5ea/resourceGroups/rg-tcloud-azure/providers/Microsoft.Network/virtualNetworks/tf-network/subnets/internal]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_storage_account.tfstorage will be created
  + resource "azurerm_storage_account" "tfstorage" {
      + access_tier                      = (known after apply)
      + account_kind                     = "StorageV2"
      + account_replication_type         = "LRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + large_file_share_enabled         = (known after apply)
      + location                         = "northcentralus"
      + min_tls_version                  = "TLS1_2"
      + name                             = "tfendpint"
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = "rg-tcloud-azure"
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + tags                             = {
          + "environment" = "staging"
        }

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/8534e7bb-0c6b-4358-9861-7e972e81a5ea/resourceGroups/rg-tcloud-azure/providers/Microsoft.Network/virtualNetworks/tf-network/subnets/internal",
            ]
        }

      + queue_properties {

          + logging {
              + delete                = true
              + read                  = true
              + retention_policy_days = 10
              + version               = "1.0"
              + write                 = true
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @Laxman-SM, Action: `pull_request`, Workflow: `CI`*